#+BEGIN_COMMENT
.. title: Date Mean Squared Error
.. slug: date-mean-squared-error
.. date: 2018-10-22 16:46:21 UTC-07:00
.. tags: pandas,errors,dates
.. category: Pandas
.. link: 
.. description: Calculating the (Root) Mean Squared Error in pandas.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 1
* Imports
** From PyPi
#+BEGIN_SRC ipython :session rmse :results none
import pandas
#+END_SRC

#+BEGIN_SRC ipython :session rmse :results none
data = {"date": [pandas.Timestamp("2018-10-01"),
                 pandas.Timestamp("2018-10-05"),
                 pandas.Timestamp("2018-09-01"),
                 pandas.Timestamp("2018-09-05"),
                 pandas.Timestamp("2018-09-05"),
                 ],
        "value": [1, 2, 1, 2, 3]}
frame = pandas.DataFrame.from_dict(data)
date_frame = frame.set_index("date")
#+END_SRC

#+BEGIN_SRC ipython :session rmse :results output
monthly = date_frame.resample("M")
means = monthly.mean()
print(means)
#+END_SRC

#+RESULTS:
:             value
: date             
: 2018-09-30    2.0
: 2018-10-31    1.5

#+BEGIN_SRC ipython :session rmse :results output
frame["year_month"] = frame.date.apply(lambda date: pandas.Timestamp(year=date.year,
                                                                     month=date.month, day=1))
print(frame.head())
#+END_SRC

#+RESULTS:
:         date  value year_month
: 0 2018-10-01      1 2018-10-01
: 1 2018-10-05      2 2018-10-01
: 2 2018-09-01      1 2018-09-01
: 3 2018-09-05      2 2018-09-01
: 4 2018-09-05      3 2018-09-01

#+BEGIN_SRC ipython :session rmse :results output
mean_frame = means.reset_index()
mean_frame["year_month"] = mean_frame.date.apply(
    lambda date: pandas.Timestamp(year=date.year,
                                  month=date.month,
                                  day=1))
print(mean_frame)
#+END_SRC

#+RESULTS:
:         date  value year_month
: 0 2018-09-30    2.0 2018-09-01
: 1 2018-10-31    1.5 2018-10-01

#+BEGIN_SRC ipython :session rmse :results output
mean_frame.rename(dict(value="mean"), axis="columns",
                  inplace=True)
print(mean_frame)
#+END_SRC

#+RESULTS:
:         date  mean year_month
: 0 2018-09-30   2.0 2018-09-01
: 1 2018-10-31   1.5 2018-10-01

#+BEGIN_SRC ipython :session rmse :results output
merged = frame.merge(mean_frame, on="year_month")
del(merged["date_y"])
merged.rename(dict(date_x="date"), axis="columns", inplace=True)
print(merged)
#+END_SRC

#+RESULTS:
:         date  value year_month  mean
: 0 2018-10-01      1 2018-10-01   1.5
: 1 2018-10-05      2 2018-10-01   1.5
: 2 2018-09-01      1 2018-09-01   2.0
: 3 2018-09-05      2 2018-09-01   2.0
: 4 2018-09-05      3 2018-09-01   2.0

#+BEGIN_SRC ipython :session rmse :results none
merged["error"] = merged["value"] - merged["mean"]
merged["error_squared"] = merged.error.pow(2)
#+END_SRC
